%% 计算大气辐射部分 输出分别为 大气有效温度tu，td、上下行亮温、透过率

function [tbup,tbdw,tao]=AMSR_TB(f,V,L,sst,sita,r,cbh)
%% 系数 
b0=[239.5, 239.51, 240.24, 241.69, 239.45];
b1=[213.92e-2, 225.19e-2, 298.88e-2, 310.32e-2, 254.41e-2];
b2=[-460.6e-4, -446.86e-4, -725.93e-4, -814.29e-4, -512.84e-4];
b3=[457.11e-6, 391.82e-6, 814.50e-6, 998.93e-6, 452.02e-6];
b4=[-16.84e-7, -12.2e-7, -36.07e-7, -48.37e-7, -14.36e-7];
b5=[0.5, 0.54, 0.61, 0.2, 0.58];
b6=[-0.11, -0.12, -0.16, -0.2, -0.57];
b7=[-0.21E-2  -0.34E-2  -1.69E-2  -5.21E-2  -2.38E-2];
ao1=[8.34E-3, 9.08E-3, 12.15E-3, 15.75E-3, 40.06E-3];
ao2=[-0.48E-4, -0.47E-4, -0.61E-4, -0.87E-4, -2.00E-4];
av1=[0.07E-3, 0.18E-3, 1.73E-3, 5.14E-3, 1.88E-3];
av2=[0.00E-5, 0.00E-5, -0.05E-5, 0.19E-5, 0.09E-5];
al1=[7.33e-3, 1.631e-2, 4.635e-2, 6.716e-2, 1.52e-1];
al2=[-5e-5, -1.2e-4, -3.3e-4, -7.8e-4, -1.2e-3];

%% 计算td，tu
if f<=6.93
    i=1;
elseif f>6.93 && f<=10.7
    i=2;
elseif f>10.7 && f<=18.8
    i=3;
elseif f>18.8 && f<=23.8
    i=4;
else
    i=5;
end
if V<=48
    tv=273.16+0.8337*V-3.029*1e-5*V^3.33;
elseif V>48
    tv=301.16;
end
if abs(sst-tv)<=20
    kesai=1.05*(sst-tv)*(1-(sst-tv)^2/1200);
elseif abs(sst-tv)>20
    kesai=sign(sst-tv)*14;
end
td=b0(i)+b1(i)*V+b2(i)*V^2+b3(i)*V^3+b4(i)*V^4+b5(i)*kesai;
tu=td+b6(i)+b7(i)*V;
%% 计算透过率tao
Ao=ao1(i)+ao2(i)*(td-270);
Av=av1(i)*V+av2(i)*V^2;
Al=(al1(i)*L+al2(i)*V*L).*cosd(53);
Ar=ITUR(r,f,(90-sita),90,cbh);
tao=exp(-(secd(sita)*(Ao+Av+Al)+Ar));
%% 计算tbup tbdw
tbup=tu*(1-tao);
tbdw=td*(1-tao);

