function [ e0s,e1s,e2s,n1s,n2s,sig ] = compute_dielectric_model ( sst_in,s )

             %整个是计算平静海面发射率（2.1.1.1），但是没有真空的介电常数和极化方式的计算。 
             
% dielectric是电介质
% sst锛氭捣娓c]   -25 c to 40 c for pure water;
%                -2  c to 34 c for saline water;
% s锛氱洂搴ppt]    0 to 40;

x=[ 5.7230e+00, 2.2379e-02, -7.1237e-04, 5.0478e+00, -7.0315e-02, 6.0059e-04, 3.6143e+00, ...
           2.8841e-02, 1.3652e-01,  1.4825e-03, 2.4166e-04 ];
%冠宇师兄论文中 2-20的三个系数。2-18，2-24，2-22的系数，出处为Wentz2004
%模式中求纯水介电常数的四个参数，第一第二德拜松弛频率，两个常数

z=[ -3.56417e-03,  4.74868e-06,  1.15574e-05,  2.39357e-03, -3.13530e-05, ...
            2.52477e-07, -6.28908e-03,  1.76032e-04, -9.22144e-05, -1.99723e-02, ...
            1.81176e-04, -2.04265e-03,  1.57883e-04  ]; 
%2-15，2-17，2-19，2-21，2-23的系数

a0coef=[ -0.33330e-02,  4.74868e-06,  0.0e+00 ];
b1coef=[ 0.23232e-02, -0.79208e-04, 0.36764e-05, -0.35594e-06, 0.89795e-08 ];
%这一项系数的作用？
sst=sst_in;
if (sst < -30.16) 
	sst=-30.16;
end
%为什么在这里分开
sst2=sst.*sst;
sst3=sst2.*sst;
sst4=sst3.*sst;

s2=s.*s;
 
%     pure water
e0    = (3.70886e4 - 8.2168e1.*sst)./(4.21854e2 + sst);%盐度为0时频率为0时的介电常数，2-16
e1    = x(1) + x(2).*sst + x(3).*sst2;%盐度为0时，中间频率时的介电常数，2-20
n1    = (45.00 + sst)./(x(4) + x(5).*sst + x(6).*sst2);%纯水时的第一松弛拜德频率，2-18
e2    = x(7) + x(8).*sst;%纯水时无穷大频率的介电常数。2-24
n2    = (45.00 + sst)./(x(9) + x(10).*sst + x(11).*sst2);%纯水时的第二松弛拜德频率
    
%     saline water
sig35 = 2.903602 + 8.60700e-2.*sst + 4.738817e-4.*sst2 - 2.9910e-6.*sst3 + 4.3047e-9.*sst4;
% s=35时的电导率2-10
r15 = s.*(37.5109+5.45216.*s+1.4409e-2.*s2)/(1004.75+182.283.*s+s2);%2-11
alpha0 = (6.9431+3.2841.*s-9.9486e-2.*s2)/(84.850+69.024.*s+s2);%2-13
alpha1 = 49.843 - 0.2276.*s + 0.198e-2.*s2; % 2-14
rtr15 = 1.0 + (sst-15.0).*alpha0./(alpha1+sst); % 2-12
    
sig = sig35.*r15.*rtr15; % 2-9 海水的电导率
    
%    permittivity 介电常数
a0 = exp(a0coef(1).*s + a0coef(2).*s2 + a0coef(3).*s.*sst);
e0s = a0.*e0;
    
if(sst <= 30) 
	b1 = 1.0 + s.*(b1coef(1) + b1coef(2).*sst + b1coef(3).*sst2 + b1coef(4).*sst3 + b1coef(5).*sst4);
else
	b1 = 1.0 + s.*(9.1873715e-04 + 1.5012396e-04.*(sst-30));
end
      
n1s = n1.*b1;%第一德拜松弛频率 2-17
    
a1  = exp(z(7).*s + z(8).*s2 + z(9).*s.*sst);
e1s = e1.*a1;%中间频率的介电常数

b2 = 1.0 + s.*(z(10) + 0.5.*z(11).*(sst + 30));%没有找到这一项，为什么和论文不一样。
n2s = n2.*b2;%第二德拜松弛频率 2-21
    
a2 = 1.0  + s.*(z(12) + z(13).*sst);
e2s = e2.*a2;%频率无穷大时的介电常数 2-23

end