function [ t, tbdn, tbup ] = compute_atm_model ( sita, V, L, Ts, f)
% 大概看懂，这是求大气上行下行透过率的参数化，具体的语句需要学习
%%
%快速计算大气上下行亮温及透过率
%输入数据
%sita:天顶角
%V:垂直路径水汽量(mm)
%L:垂直路径液水量(mm)
%输出数据
%t:任意天顶角透过率
%tbdn:任意天顶角下行亮温
%tbup:任意天顶角上行亮温
%%
%f=6.9,10.65,18.7,23.8,36.5
t0coem=[0.9902	 2.073e-05	-0.0105	-9.818e-07	-4.545e-06;
        0.9892	-7.665e-05	-0.0258	-1.198e-06	 3.402e-05;
		0.9853	-1.511e-03	-0.0785	 6.462e-09	 2.193e-04;
		0.9805	-4.870e-03	-0.1317	 6.953e-06	 1.028e-03;
		0.9525	-1.287e-03	-0.2473	-4.942e-06	 7.563e-04];

tdcoem=[162.5  1.505  -0.0277	1.695e-04	0.2898;
        159.4  1.701  -0.0314	1.898e-04	0.3015;
		137.8  2.026  -0.0431	2.919e-04	0.3916;
		127.3  1.912  -0.0432	3.069e-04	0.4401;
		153.8  1.979  -0.0391	2.507e-04	0.3241];
		
tucoem=[-0.0906	-0.0011; 
        -0.0988	-0.0020;
		-0.1386	-0.0103;
		-0.1498	-0.0329;
		-0.4549	-0.0155];
%%
V2=V.*V;
VL=V.*L;
L2=L.*L;
V3=V.^3;

caccoe1=[ 1, V, L, V2, VL ];
caccoe2=[ 1, V, V2, V3, Ts];
caccoe3=[ 1, V ];

switch f
	case 6.9
		n=1;
	case 10.65
		n=2;
	case 18.7
		n=3;
	case 23.8
		n=4;
	case 36.5
		n=5;
end
%这几句话什么意思
t0coe=t0coem(n,:);
tdcoe=tdcoem(n,:);
tucoe=tucoem(n,:);

t0=dot(t0coe,caccoe1);
td=dot(tdcoe,caccoe2);
tu=dot(tucoe,caccoe3)+td;%dot点乘括号中的
%%
if sita==0
    t=t0;
    tbdn=td.*(1-t);
    tbup=tu.*(1-t);
else
    secant=1.0./cos(sita./180.0.*pi);
    t=exp(secant.*log(t0));
	tbdn=td.*(1-t);
    tbup=tu.*(1-t);
end

end

